artillery/output.txt

--------------------------------------
Metrics for period to: 23:54:20(+0200) (width: 8.534s)
--------------------------------------

http.codes.200: ................................................................ 53
http.codes.422: ................................................................ 7
http.codes.429: ................................................................ 36
http.downloaded_bytes: ......................................................... 115812
http.request_rate: ............................................................. 13/sec
http.requests: ................................................................. 96
http.response_time:
  min: ......................................................................... 48
  max: ......................................................................... 137
  mean: ........................................................................ 71.9
  median: ...................................................................... 62.2
  p95: ......................................................................... 125.2
  p99: ......................................................................... 135.7
http.responses: ................................................................ 96
vusers.completed: .............................................................. 48
vusers.created: ................................................................ 48
vusers.created_by_name.NameDay API Test: ....................................... 48
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 142.5
  max: ......................................................................... 287
  mean: ........................................................................ 193.1
  median: ...................................................................... 186.8
  p95: ......................................................................... 267.8
  p99: ......................................................................... 273.2


--------------------------------------
Metrics for period to: 23:54:30(+0200) (width: 9.586s)
--------------------------------------

http.codes.429: ................................................................ 122
http.downloaded_bytes: ......................................................... 784948
http.request_rate: ............................................................. 14/sec
http.requests: ................................................................. 122
http.response_time:
  min: ......................................................................... 46
  max: ......................................................................... 85
  mean: ........................................................................ 55.9
  median: ...................................................................... 55.2
  p95: ......................................................................... 64.7
  p99: ......................................................................... 70.1
http.responses: ................................................................ 122
vusers.completed: .............................................................. 61
vusers.created: ................................................................ 61
vusers.created_by_name.NameDay API Test: ....................................... 61
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 136.7
  max: ......................................................................... 220
  mean: ........................................................................ 156.3
  median: ...................................................................... 153
  p95: ......................................................................... 175.9
  p99: ......................................................................... 186.8


--------------------------------------
Metrics for period to: 23:54:40(+0200) (width: 9.697s)
--------------------------------------

http.codes.429: ................................................................ 138
http.downloaded_bytes: ......................................................... 887892
http.request_rate: ............................................................. 14/sec
http.requests: ................................................................. 138
http.response_time:
  min: ......................................................................... 44
  max: ......................................................................... 131
  mean: ........................................................................ 64.6
  median: ...................................................................... 57.4
  p95: ......................................................................... 111.1
  p99: ......................................................................... 122.7
http.responses: ................................................................ 138
vusers.completed: .............................................................. 69
vusers.created: ................................................................ 69
vusers.created_by_name.NameDay API Test: ....................................... 69
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 135.6
  max: ......................................................................... 869.9
  mean: ........................................................................ 201.5
  median: ...................................................................... 179.5
  p95: ......................................................................... 267.8
  p99: ......................................................................... 368.8


Phase completed: Faza ramp-up (index: 0, duration: 60s) 23:55:11(+0200)

--------------------------------------
Metrics for period to: 23:54:50(+0200) (width: 9.964s)
--------------------------------------

http.codes.429: ................................................................ 149
http.downloaded_bytes: ......................................................... 952232
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 152
http.response_time:
  min: ......................................................................... 47
  max: ......................................................................... 131
  mean: ........................................................................ 63
  median: ...................................................................... 56.3
  p95: ......................................................................... 98.5
  p99: ......................................................................... 113.3
http.responses: ................................................................ 149
vusers.completed: .............................................................. 74
vusers.created: ................................................................ 78
vusers.created_by_name.NameDay API Test: ....................................... 78
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 132.9
  max: ......................................................................... 389.9
  mean: ........................................................................ 185.2
  median: ...................................................................... 169
  p95: ......................................................................... 301.9
  p99: ......................................................................... 314.2


--------------------------------------
Metrics for period to: 23:55:00(+0200) (width: 9.958s)
--------------------------------------

http.codes.429: ................................................................ 169
http.downloaded_bytes: ......................................................... 1093780
http.request_rate: ............................................................. 18/sec
http.requests: ................................................................. 167
http.response_time:
  min: ......................................................................... 48
  max: ......................................................................... 168
  mean: ........................................................................ NaN
  median: ...................................................................... 63.4
  p95: ......................................................................... 125.2
  p99: ......................................................................... 162.4
http.responses: ................................................................ 169
vusers.completed: .............................................................. 85
vusers.created: ................................................................ 82
vusers.created_by_name.NameDay API Test: ....................................... 82
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 140.9
  max: ......................................................................... 636
  mean: ........................................................................ 230.5
  median: ...................................................................... 210.6
  p95: ......................................................................... 424.2
  p99: ......................................................................... 584.2


--------------------------------------
Metrics for period to: 23:55:10(+0200) (width: 9.482s)
--------------------------------------

http.codes.429: ................................................................ 180
http.downloaded_bytes: ......................................................... 1158120
http.request_rate: ............................................................. 21/sec
http.requests: ................................................................. 179
http.response_time:
  min: ......................................................................... 49
  max: ......................................................................... 222
  mean: ........................................................................ 71.3
  median: ...................................................................... 66
  p95: ......................................................................... 111.1
  p99: ......................................................................... 133
http.responses: ................................................................ 180
vusers.completed: .............................................................. 90
vusers.created: ................................................................ 89
vusers.created_by_name.NameDay API Test: ....................................... 89
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 132.7
  max: ......................................................................... 480.6
  mean: ........................................................................ 204.2
  median: ...................................................................... 190.6
  p95: ......................................................................... 242.3
  p99: ......................................................................... 459.5


--------------------------------------
Metrics for period to: 23:55:20(+0200) (width: 2.607s)
--------------------------------------

http.codes.200: ................................................................ 23
http.codes.422: ................................................................ 3
http.codes.429: ................................................................ 20
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 29/sec
http.requests: ................................................................. 46
http.response_time:
  min: ......................................................................... 54
  max: ......................................................................... 164
  mean: ........................................................................ 97.2
  median: ...................................................................... 96.6
  p95: ......................................................................... 135.7
  p99: ......................................................................... 144
http.responses: ................................................................ 46
vusers.completed: .............................................................. 23
vusers.created: ................................................................ 23
vusers.created_by_name.NameDay API Test: ....................................... 23
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 206.1
  max: ......................................................................... 448.2
  mean: ........................................................................ 328.5
  median: ...................................................................... 333.7
  p95: ......................................................................... 432.7
  p99: ......................................................................... 441.5


All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 23:55:13(+0200)
--------------------------------

http.codes.200: ................................................................ 76
http.codes.422: ................................................................ 10
http.codes.429: ................................................................ 814
http.downloaded_bytes: ......................................................... 990836
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 44
  max: ......................................................................... 222
  mean: ........................................................................ NaN
  median: ...................................................................... 61
  p95: ......................................................................... 117.9
  p99: ......................................................................... 144
http.responses: ................................................................ 900
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.NameDay API Test: ....................................... 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 132.7
  max: ......................................................................... 869.9
  mean: ........................................................................ 204.3
  median: ...................................................................... 179.5
  p95: ......................................................................... 354.3
  p99: ......................................................................... 450.4